nc: 5

scales:
  m: [0.50, 1.00, 512] 
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, SonarSPDConv, [256]]       # 1-P2/4
  - [-1, 2, C3k2, [128, False]]        # 2
  - [-1, 1, SonarSPDConv, [512]]       # 3-P3/8
  - [-1, 2, C3k2, [256, False]]        # 4
  - [-1, 1, EMA, [32]]                 # 5-Attention on P3 (Fixed Factor)
  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
  - [-1, 2, C3k2, [512, True]]         # 7
  - [-1, 1, Conv, [1024, 3, 2]]        # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 9
  - [-1, 1, SPPF, [1024, 5]]           # 10
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11 (P4)
  - [[-1, 7], 1, BiFPN_Concat2, [512]]  # 12-BiFPN Fusion
  - [-1, 2, C3k2, [512, False]]        # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14 (P3)
  - [[-1, 5], 1, BiFPN_Concat2, [256]]  # 15-BiFPN Fusion
  - [-1, 2, C3k2, [256, False]]        # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17 (P2)
  - [[-1, 2], 1, BiFPN_Concat2, [128]]  # 18-BiFPN Fusion
  - [-1, 2, C3k2, [128, False]]        # 19

  - [-1, 1, CoordAtt, [128, 128]]      # 20
  
  # Detect at 4 scales: P2, P3, P4, P5
  - [[20, 16, 13, 10], 1, Detect, [nc]] # 21
